app/views/user/edit_sessions.html.erb

SELECT "events".* FROM "events"
---

<%= select("event", "sessionid", ["--Unregister--"].concat(Event.all.collect {|e| [ "#{e.name} - #{e.currentcapacity}/#{e.maxcapacity}", e.id ] }), { :include_blank => true }) %>