app/controllers/user_controller.rb

  def login
    if request.post?
      if User.authenticate(params[:user][:name], params[:user][:student_id])
        flash[:message]  = "You have successfully logged in as #{params[:user][:name]}."
        session[:user] = params[:user]
        session[:user][:event] = Event.find(:first, :conditions=>["id=?", User.find(:first, :conditions=>["id=? AND name=?", params[:user][:student_id], params[:user][:name]]).sessionid])
---
SELECT "events".* FROM "events" WHERE "events"."user_id" = 28477 LIMIT 1
SELECT "users".* FROM "users" WHERE (name = NULL AND student_id = NULL) LIMIT 1

  def register_event
    if request.post?
      if params[:event][:sessionid] == "--Unregister--" # They clicked "--Unregister--" -- unregister if they're registered, do nothing otherwise.
        unless session[:user][:event].nil?
          Event.unregister_event(session[:user][:event].id)
          # Clear session ID in database
          ActiveRecord::Base.connection.execute("UPDATE Users SET sessionid=0 WHERE id=#{session[:user][:student_id]}")
          flash[:error] = "You have cancelled your registration for #{session[:user][:event].name}."
          session[:user][:event] = nil
        else
          flash[:error] = "You are not currently registered for an event."
        end
        redirect_to :controller => "user", :action => "edit_sessions"
        return
      end # params empty SID check

      if Event.is_available?(params[:event][:sessionid])
        # first check to see if we're already registered for a session - if so, unregister
        if not session[:user][:event].nil?
          Event.unregister_event(session[:user][:event].id)
          # Clear session ID in database
          ActiveRecord::Base.connection.execute("UPDATE Users SET sessionid=0 WHERE id=#{session[:user][:student_id]}")
          flash[:error] = "You have cancelled your registration for #{session[:user][:event].name}."
          session[:user][:event] = nil
        end
        # now we can register!
        Event.register_event(params[:event][:sessionid])
        # update session data
        session[:user][:event] = Event.find(:first, :conditions=>["id=?", params[:event][:sessionid]])
---
SELECT "events".* FROM "events" WHERE (id='1') LIMIT 1